[{"Name": "This Website", "Desc": "This personal portfolio is made entirely from scratch. The goal of this site is to help display my experience in software development, as well as give me the opportunity to practice and improve upon my web development skills in my free time. The website itself is mostly finished, however the information on the website will update with my career. I've kept accessibility in mind, using both automatic testing (via tools such as WAVE and Axe DevTools) and manual testing to ensure everything from color contrast and a mobile first design to tabindexes and different settings for reduced motion preferences makes the site as user friendly as possible to everyone.While designing what the site would look like, I went out of my way to incorporate CSS techniques I wasn't familiar with, such as CSS shapes (seen in the home page) CSS animations (also seen in the home page), parallax effects (seen in the career page), and iframes (seen in this page). I also used techniques I was familiar with when I felt they were a good fit, such as the static header (which turns into a hamburger menu for smaller screens), the static footer (which uses Font Awesome icons and a little Javascript to keep the copyright date recent), and Javascript event listeners (seen in the education page to expand and close project info).", "Git": "https://github.com/walleraa/Professional-Portfolio"}, {"Name": "The_Elements", "Desc": "This is a small game I made over winter break. Made entirely from scratch, it uses JavaScript event listeners to trace key strokes to move the player around, altering the DOM to reflect this. It only has a handful of levels and is pretty rudimentary, but it was a blast to create the logic and math that goes into simple interactions like movement and collisions. The logic is done using percentages to allow the game to properly display on any size screen, and the game utilizes local storage to save your progress.", "Git": "https://github.com/walleraa/The_Elements"}, {"Name": "Etch-A-Sketch", "Desc": "This was something I made in my free time and later added to my final project for SI 339 as \"extra features.\" It uses JavaScript to detect user input (either through buttons or keystrokes) and the HTML canvas element to draw said input. It also utilizes session storage to save a user's drawing as they browse other parts of the site.", "Git": "https://github.com/walleraa/Si339portfolio"}]